a = "ครูจารุวัชร ครูสิริลักขณ์ ครูเกสินี ครูฉันทนา ครูอาภาศรี ครูอาภาศรี ครูเอนก ชุมนุม"
b = "ครูเกสินี ครูสมศักดิ ครูณชมน ครูณชมน ครูศิริขวัญ ครูอุบลวรรณ ครูฉันทนา ครูวรายุทธ"
c = "ครูสิริลักขณ์ ครูกานต์สินี ครูสมศักดิ ครูอุบลวรรณ ครูเกสินี วิชาเลือก วิชาเลือก วิชาเลือก"
d = "ครูสมศักดิ์ ครูเอนก ครูเอนก ว่าง อาภาศรี โครงงาน โครงงาน อุบลวรรณ"
e = "ครูสมศักดิ์ ครูณชมน ครูอรรถพล ครูอรรถพล ครูรัตน์กร บรรยาย บรรยาย โฮมรูม"

m = []
m.append(a.split())
m.append(b.split())
m.append(c.split())
m.append(d.split())
m.append(e.split())

print(m)